Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectScalingOptions Enumeration
 The options for controlling the scaling of the objects in the drawing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum EmbeddedObjectScalingOptions
Public Enumeration EmbeddedObjectScalingOptions
Members
Member name | Value | Description
ScaleX | 1 | Scales the object in the X direction.
ScaleXY | 3 | Scales the object in the X and Y directions.
ScaleToFit | 4 | Scales the object to fit in the frame in the Y direction.
ScaleBestFit | 8 | The object is scaled inside the frame, still maintaining its original aspect ratio.
See Also
Reference
Tekla.Structures.Drawing Namespace